1. Напишите программу, которая запрашивает у пользователя строку и преобразует ее, удаляя все гласные буквы из строки. 
Используйте метод replace() для замены гласных букв на пустую строку. 
Выведите преобразованную строку на экран с помощью команды print.
text = input()
letter = "aeyuioAEYUIO"

for i in letter:
    text = text.replace(i, "")
print("Строка без глассных", text)





text = input("Введите текст: ")
have_dupl = False
alfabet = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"

for i in alfabet:
    count = text.count(i)
    if count > 1:
        print(f"Символ '{i}' встречается {count} раз(а).")
        have_dupl = True

if not have_dupl:
    print("Все символы в строке уникальны.")




text = input('Введите строку:')
a = int(input('Введите ширину:'))

if a % 2 == 0:
    res = text.center(a)
else: res = text.rjust(a)

print("Результат:")
print(f"'{res}'")